from 60424, Salary
to   60724, 60424, 0.38, usd, h,hsbc130

from 60430, 50731, 5.26, usd, l,2355326  •
to   70430, 60430, 5.41, usd, l,2673869

from 60428, 50728, 1.44, hkd, c,hangs    ✘
to   61028, 60428, 1.49, hkd, c,hangs

from 60428, 50728, 0.34, usd, c,hangs    ✘
to   61028, 60428, 0.35, usd, c,hangs

to   60520, 60220, 0.03, aud, h,hsbc126
from 60220, 50818, 0.03, aud, h,hsbc122  ✔️

to   70217, 60217, 1.71,usd, l,2168   ----
from 60217, 50214, 1.64,usd, l,2168917 🮱

to   60805, 60206, 0.05,usd, c,hangs  ️ ---- check mat date
from 60206, 50806, 0.05,usd, c,hangs  ️ ✘

to   70129, 60129, 1.83,usd, l.24728
from 60129, 51029, 1.82,usd, l.2472858 🮱

to   70111, 60109, 0.57,usd, l.2135658 🮱
from 60109, 50109, 0.55,usd, l.2135658

to   60330, 51229, 2.50,hkd, h,hsbc125☑️
from 51229, 50925, 3.00,hkd, h,hsbc124✅

to   51208, 41206, 1.35,usd, l,2096070✅
from 51208, 41206, 1.35,usd, l,2096070✅
